// 급수별 과목 매핑
export const SUBJECTS_BY_LICENSE_AND_LEVEL: Record<
  string,
  Record<string, string[]>
> = {
  항해사: {
    "1급": ["항해", "운용", "법규", "영어", "상선전문", "어선전문"],
    "2급": ["항해", "운용", "법규", "영어", "상선전문", "어선전문"],
    "3급": ["항해", "운용", "법규", "영어", "상선전문", "어선전문"],
    "4급": ["항해", "운용", "법규", "영어", "상선전문", "어선전문"],
    "5급": ["항해", "법규", "운용", "상선전문", "어선전문"],
    "6급": ["항해", "법규", "운용", "상선전문", "어선전문"],
  },
  기관사: {
    "1급": ["기관1", "기관2", "기관3", "직무일반", "영어"],
    "2급": ["기관1", "기관2", "기관3", "직무일반", "영어"],
    "3급": ["기관1", "기관2", "기관3", "직무일반", "영어"],
    "4급": ["기관1", "기관2", "기관3", "직무일반", "영어"],
    "5급": ["기관1", "기관2", "기관3", "직무일반"],
    "6급": ["기관1", "기관2", "기관3", "직무일반"],
  },
  소형선박조종사: {
    "0": ["항해", "운용", "법규", "기관"],
  },
};
